<?php
/**
 * @link      https://datagram.co.jp/source/bksj for the canonical source repository
 * @copyright Copyright (c) 2006-2019 Datagram Ltd. (https://datagram.co.jp)
 * @license   https://datagram.co.jp/source/bksj/license.txt
 */

require_once(dirname(__FILE__) . '/../../lib/Model.php');

class RootMenuModel extends Model
{
    public function chkDatabse() {

        $this->connect();
        $sql = "SELECT COUNT(*) AS `cnt` FROM `t_basic`";
        $rec = $this->getRecord($sql);
        $this->close();

        if ($rec[0]['cnt'] < 1) {
            return $this->_init();
        }

        return '';
    }

    private function _init() {

        $err = $this->_initBasic();

        if (!empty($err)) {
            return $err;
        }

        $err = $this->_initSection();

        if (!empty($err)) {
            return $err;
        }

        $err = $this->_initAccount();

        if (!empty($err)) {
            return $err;
        }

        $err = $this->_initItem();

        if (!empty($err)) {
            return $err;
        }

        $err = $this->_initTax();

        if (!empty($err)) {
            return $err;
        }

        $err = $this->_initEra();

        if (!empty($err)) {
            return $err;
        }

        return '';
    }

    private function _initBasic() {

        $err = '';

        $this->connect();
        $this->begin();

        try {

            $sql =  "INSERT INTO `t_basic`"
                 . " (`name`, `disp_name`, `term_year`, `term_begin`, `term_end`, `round`, `calendar`, `valid_flg`)"
                 . " VALUES"
                 . " ('Datagram', '有限会社データグラム', 2018, '2018-04-01', '2019-03-31', 0, 'japanese', FALSE)"
                 ;
            $ans = $this->query($sql);

            for ($i = 0; $i < 99; $i++) {
                $sql =  "INSERT INTO `t_basic`"
                     . " (`name`, `disp_name`, `term_year`, `term_begin`, `term_end`, `round`, `calendar`, `valid_flg`)"
                     . " VALUES"
                     . " ('名称', '表示名称', 2018, '2018-04-01', '2019-03-31', 0, 'japanese', FALSE)"
                     ;
                $ans = $this->query($sql);
            }

        } catch(Exception $e) {
            $err = $e->getMessage();
        }

        if (empty($err)) {
            $this->commit();
        } else {
            $this->rollback();
        }

        $this->close();

        return $err;
    }

    private function _initSection() {

        $err = '';

        $this->connect();
        $this->begin();

        try {
            $sql = "SELECT `id` FROM `t_basic` ORDER BY `id`";
            $rec = $this->getRecord($sql);

            foreach ($rec as $r) {

                $sql =  "INSERT INTO `t_section`"
                     . " (`bid`, `kana`, `name`, `update_person`)"
                     . " VALUES"
                     . " ('" . $r['id'] . "'"
                     . ", 'きょうつう'"
                     . ", '共通'"
                     . ", '" . $_SESSION['minfo']['mid'] . "'"
                     .  ")"
                     ;
                $ans = $this->query($sql);
            }

        } catch(Exception $e) {
            $err = $e->getMessage();
        }

        if (empty($err)) {
            $this->commit();
        } else {
            $this->rollback();
        }

        $this->close();

        return $err;
    }

    private function _initAccount() {

        $err = '';
        $acc = $this->_getAccount();

        $this->connect();
        $this->begin();

        try {
            $sql = "SELECT `id` FROM `t_basic` ORDER BY `id`";
            $rec = $this->getRecord($sql);

            foreach ($rec as $r) {
                foreach ($acc as $a) {
                    $sql =  "INSERT INTO `t_account`"
                         . " (`bid`, `ccd`, `item`, `item_ccd`, `division`, `kana`, `name`, `delete_flg`, `edit_flg`, `update_person`)"
                         . " VALUES"
                         . " ('" . $r['id'] . "'"
                         . ", '" . $a[0] . "'"
                         . ", '" . $a[1] . "'"
                         . ", '" . $a[2] . "'"
                         . ", '" . $a[3] . "'"
                         . ", '" . $a[4] . "'"
                         . ", '" . $a[5] . "'"
                         . ", FALSE"
                         . ", FALSE"
                         . ", '" . $_SESSION['minfo']['mid'] . "'"
                         .  ")"
                         ;
                    $ans = $this->query($sql);
                }
            }

        } catch(Exception $e) {
            $err = $e->getMessage();
        }

        if (empty($err)) {
            $this->commit();
        } else {
            $this->rollback();
        }

        $this->close();

        return $err;
    }

    private function _initItem() {

        $err = '';
        $acc = $this->_getAccount();

        $this->connect();
        $this->begin();

        try {
            $sql = "SELECT `id` FROM `t_basic` ORDER BY `id`";
            $rec = $this->getRecord($sql);

            foreach ($rec as $r) {
                foreach ($acc as $a) {
                    $sql =  "INSERT INTO `t_item`"
                         . " (`bid`, `kcd`, `ccd`, `account`, `item`, `kana`, `name`, `valid_flg`, `delete_flg`, `edit_flg`, `update_person`)"
                         . " VALUES"
                         . " ('" . $r['id'] . "'"
                         . ", '" . sprintf("%4d%02d00", $a[0], $a[1]) . "'"
                         . ", '" . $a[0] . "'"
                         . ", '" . $a[1] . "'"
                         . ", '0'"
                         . ", '" . $a[4] . "'"
                         . ", '" . $a[5] . "'"
                         . ", TRUE"
                         . ", FALSE"
                         . ", FALSE"
                         . ", '" . $_SESSION['minfo']['mid'] . "'"
                         .  ")"
                         ;
                    $ans = $this->query($sql);
                }
            }

        } catch(Exception $e) {
            $err = $e->getMessage();
        }

        if (empty($err)) {
            $this->commit();
        } else {
            $this->rollback();
        }

        $this->close();

        return $err;
    }

    private function _getAccount() {
        return [
            ['0',    '0',  '0',  '0', 'しょぐち', '諸口'],
            ['1111', '11', '10', '0', 'げんきん', '現金'],
            ['1112', '11', '10', '0', 'とうざよきん', '当座預金'],
            ['1112', '12', '10', '0', 'ふつうよきん', '普通預金'],
            ['1112', '13', '10', '0', 'つうちよきん', '通知預金'],
            ['1112', '19', '10', '0', 'そのたりゅうどうせいよきん', '其他流動性預金'],
            ['1112', '21', '10', '0', 'ていきよきん', '定期預金'],
            ['1112', '22', '10', '0', 'ていきつみたて', '定期積金'],
            ['1112', '29', '10', '0', 'そのたこていせいよきん', '其他固定性預金'],
            ['1121', '11', '10', '0', 'うけとりてがた', '受取手形'],
            ['1131', '11', '10', '0', 'うりかけきん', '売掛金'],
            ['1139', '11', '10', '1', 'かしだおれひきあてきん', '貸倒引当金'],
            ['1140', '11', '10', '0', 'ゆうかしょうけん', '有価証券'],
            ['1210', '11', '14', '0', 'しょうひん', '商品'],
            ['1220', '11', '13', '0', 'せいひん', '製品'],
            ['1250', '11', '11', '0', 'げんざいりょう', '原材料'],
            ['1260', '11', '12', '0', 'しかかりきん', '仕掛品'],
            ['1270', '11', '10', '0', 'ちょぞうひん', '貯蔵品'],
            ['1410', '11', '10', '0', 'まえわたしきん', '前渡金'],
            ['1420', '11', '10', '0', 'かりばらいきん', '仮払金'],
            ['1420', '21', '10', '0', 'かりばらいしょうひぜい', '仮払消費税'],
            ['1421', '11', '10', '0', 'まえばらいひよう', '前払費用'],
            ['1430', '22', '10', '0', 'みしゅうしょうひぜい', '未収消費税'],
            ['1441', '11', '10', '0', 'たんきかしつけきん', '短期貸付金'],
            ['1450', '11', '10', '0', 'みしゅうきん', '未収金'],
            ['1460', '11', '10', '0', 'たてかえきん', '立替金'],
            ['1990', '11', '10', '1', 'かしだおれひきあてきん', '貸倒引当金'],
            ['2111', '11', '10', '0', 'たてもの', '建物'],
            ['2111', '12', '10', '0', 'たてものふぞくせつび', '建物付属設備'],
            ['2121', '11', '10', '0', 'こうちくぶつ', '構築物'],
            ['2131', '11', '10', '0', 'きかいそうち', '機械装置'],
            ['2151', '11', '10', '0', 'しゃりょううんぱんぐ', '車輌運搬具'],
            ['2151', '12', '10', '0', 'ふつうじょうようしゃ', '普通乗用車'],
            ['2161', '11', '10', '0', 'こうぐきぐびひん', '工具器具備品'],
            ['2210', '11', '10', '0', 'とち', '土地'],
            ['2270', '11', '10', '0', 'けんせつかりかんじょう', '建設仮勘定'],
            ['2290', '11', '10', '1', 'げんかしょうきゃくりゅけいがく', '減価償却累計額'],
            ['2330', '11', '10', '0', 'しゃくちけん', '借地権'],
            ['2420', '11', '10', '0', 'でんわかにゅうけん', '電話加入権'],
            ['2611', '11', '10', '0', 'とうしゆうかしょうけん', '投資有価証券'],
            ['2620', '11', '10', '0', 'ほしょうきん', '保証金'],
            ['2620', '19', '10', '0', 'そのたとうし', 'その他投資'],
            ['2621', '11', '10', '0', 'しゅっしきん', '出資金'],
            ['2631', '11', '10', '0', 'ちょうきかしつけきん', '長期貸付金'],
            ['2639', '11', '10', '1', 'かしだおれひきあてきん', '貸倒引当金'],
            ['2810', '11', '10', '0', 'ちょうきまえばらいひよう', '長期前払費用'],
            ['3110', '11', '10', '1', 'そうりつひ', '創立費'],
            ['4110', '11', '20', '1', 'わりびきてがた', '割引手形'],
            ['4110', '12', '20', '1', 'うらがきてがた', '裏書手形'],
            ['4111', '11', '20', '1', 'しはらいてがた', '支払手形'],
            ['4120', '11', '20', '1', 'かいかけきん', '買掛金'],
            ['4130', '11', '20', '1', 'たんきかりいれきん', '短期借入金'],
            ['4140', '11', '20', '1', 'みはらいきん', '未払金'],
            ['4140', '12', '20', '1', 'みはらいひよう', '未払費用'],
            ['4140', '21', '20', '1', 'みはらいしょうひぜい', '未払消費税'],
            ['4147', '11', '21', '1', 'みはらいほうじんぜいとう', '未払法人税等'],
            ['4160', '11', '20', '1', 'まえうけきん', '前受金'],
            ['4160', '12', '20', '1', 'かりうけきん', '仮受金'],
            ['4160', '22', '20', '1', 'かりうけしょうひぜい', '仮受消費税'],
            ['4170', '11', '20', '1', 'あずかりきん', '預り金'],
            ['4210', '11', '20', '1', 'まえうけしゅうえき', '前受収益'],
            ['4350', '11', '20', '1', 'しょうよひきあてきん', '賞与引当金'],
            ['5141', '11', '20', '1', 'ちょうきかりいれきん', '長期借入金'],
            ['5310', '11', '20', '1', 'たいしょくきゅうよひきあてきん', '退職給与引当金'],
            ['7110', '11', '30', '1', 'しほんきん', '資本金'],
            ['7210', '11', '30', '1', 'しほんじゅんびきん', '資本準備金'],
            ['7260', '11', '30', '1', 'りえきじゅんびきん', '利益準備金'],
            ['7310', '11', '30', '1', 'そのたじょうよきん', 'その他剰余金'],
            ['7328', '11', '30', '1', 'べっとつみたてきん', '別途積立金'],
            ['8111', '11', '61', '1', 'うりあげだか', '売上高'],
            ['8111', '12', '61', '1', 'ひかぜいうりあげだか', '非課税売上高'],
            ['8111', '21', '62', '1', 'しょうひんうりあげだか', '商品売上高'],
            ['8111', '22', '62', '1', 'ひかぜいしょうひんうりあげだか', '非課税商品売上高'],
            ['8119', '11', '61', '0', 'うりあげねびきだか', '売上値引高'],
            ['8119', '12', '61', '0', 'うりあげもどりだか', '売上戻り高'],
            ['8119', '21', '62', '0', 'しょうひんうりあげねびきだか', '商品売上値引高'],
            ['8119', '22', '62', '0', 'しょうひんうりあげもどりだか', '商品売上戻り高'],
            ['8210', '11', '44', '0', 'きしゅしょうひんたなおろしだか', '期首商品棚卸高'],
            ['8210', '12', '43', '0', 'きしゅせいひんたなおろしだか', '期首製品棚卸高'],
            ['8210', '21', '41', '0', 'きしゅざいりょうたなおろしだか', '期首材料棚卸高'],
            ['8210', '31', '42', '0', 'きしゅしかかりたなおりしだか', '期首仕掛棚卸高'],
            ['8221', '11', '71', '0', 'しいれだか', '仕入高'],
            ['8221', '12', '71', '0', 'ひかぜいしいれだか', '非課税仕入高'],
            ['8221', '21', '51', '0', 'ざいりょうしいれだか', '材料仕入高'],
            ['8221', '22', '51', '0', 'ひかぜいざいりょうしいれ', '非課税材料仕入'],
            ['8229', '11', '71', '1', 'しいれねびきだか', '仕入値引高'],
            ['8229', '12', '71', '1', 'しいれもどしだか', '仕入戻し高'],
            ['8229', '21', '51', '1', 'ざいりょうしいれねびきだか', '材料仕入値引高'],
            ['8229', '22', '51', '1', 'ざいりょうしいれもどしだか', '材料仕入戻し高'],
            ['8230', '11', '52', '0', 'ちんぎんてあて（せい）', '賃金手当(製)'],
            ['8230', '12', '52', '0', 'しょうよ（せい）', '賞与(製)'],
            ['8230', '13', '52', '0', 'ざっきゅう（せい）', '雑給(製)'],
            ['8230', '14', '52', '0', 'たいしょくきん（せい）', '退職金(製)'],
            ['8230', '15', '53', '0', 'ほうていふくりひ（せい）', '法定福利費(製)'],
            ['8230', '16', '53', '0', 'ふくりこうせいひ（せい）', '福利厚生費(製)'],
            ['8230', '17', '53', '0', 'そのたろうむひ（せい）', '其他労務費(製)'],
            ['8230', '21', '54', '0', 'がいちゅうかこうひ（せい）', '外注加工費(製)'],
            ['8230', '31', '54', '0', 'どうりょくひ（せい）', '動力費(製)'],
            ['8230', '32', '54', '0', 'ちんたいりょう（せい）', '賃貸料(製)'],
            ['8230', '33', '54', '0', 'ほけんりょう（せい）', '保険料(製)'],
            ['8230', '34', '54', '0', 'しゅうぜんひ（せい）', '修繕費(製)'],
            ['8230', '35', '54', '0', 'げんかしょうきゃくひ（せい）', '減価償却費(製)'],
            ['8230', '36', '54', '0', 'にづくりうんちん（せい）', '荷造運賃(製)'],
            ['8230', '37', '54', '0', 'しょうもうひんひ（せい）', '消耗品費(製)'],
            ['8230', '38', '54', '0', 'すいどうこうねつひ（せい）', '水道光熱費(製)'],
            ['8230', '39', '54', '0', 'こうさいひ（せい）', '交際費(製)'],
            ['8230', '41', '54', '0', 'りょひこうつうひ（せい）', '旅費交通費(製)'],
            ['8230', '42', '54', '0', 'つうしんひ（せい）', '通信費(製)'],
            ['8230', '43', '54', '0', 'そぜいこうか（せい）', '租税公課(製)'],
            ['8230', '44', '54', '0', 'けんきゅうひ（せい）', '研究費(製)'],
            ['8230', '91', '54', '0', 'ざっぴ（せい）', '雑費(製)'],
            ['8230', '99', '54', '1', 'たかんじょうへふりかえ', '他勘定へ振替'],
            ['8240', '11', '49', '1', 'きまつしょうひんたなおろしだか', '期末商品棚卸高'],
            ['8240', '12', '48', '1', 'きまつせいひんたなおろしだか', '期末製品棚卸高'],
            ['8240', '21', '46', '1', 'きまつざいりょうたなおろしだか', '期末材料棚卸高'],
            ['8240', '31', '47', '1', 'きまつしかかりたなおりしだか', '期末仕掛棚卸高'],
            ['8310', '11', '72', '0', 'やくいんほうしゅう', '役員報酬'],
            ['8310', '21', '72', '0', 'きゅうよてあて', '給料手当'],
            ['8310', '22', '72', '0', 'しょうよ', '賞与'],
            ['8310', '23', '72', '0', 'ざっきゅう', '雑給'],
            ['8310', '24', '72', '0', 'たいしょくきん', '退職金'],
            ['8310', '25', '73', '0', 'ほうていふくりひ', '法定福利費'],
            ['8310', '26', '73', '0', 'ふくりこうせいひ', '福利厚生費'],
            ['8310', '31', '74', '0', 'たいしょくひきあてきんくりいれ', '退職引当金繰入'],
            ['8310', '41', '74', '0', 'りょひこうつうひ', '旅費交通費'],
            ['8310', '42', '74', '0', 'つうしんひ', '通信費'],
            ['8310', '43', '74', '0', 'はんばいてすうりょう', '販売手数料'],
            ['8310', '44', '74', '0', 'にづくりうんちん', '荷造運賃'],
            ['8310', '45', '74', '0', 'こうこくせんでんひ', '広告宣伝費'],
            ['8310', '46', '74', '0', 'こうさいひ', '交際費'],
            ['8310', '47', '74', '0', 'かいぎひ', '会議費'],
            ['8310', '48', '74', '0', 'ねんりょうひ', '燃料費'],
            ['8310', '49', '74', '0', 'すいどうこうねつひ', '水道光熱費'],
            ['8310', '51', '74', '0', 'しょうもうひんひ', '消耗品費'],
            ['8310', '52', '74', '0', 'そぜいこうか', '租税公課'],
            ['8310', '53', '74', '0', 'としょひ', '図書費'],
            ['8310', '54', '74', '0', 'しはらいてすうりょう', '支払手数料'],
            ['8310', '55', '74', '0', 'しょかいひ', '諸会費'],
            ['8310', '56', '74', '0', 'けんきゅうひ', '研究費'],
            ['8310', '57', '74', '0', 'ちんたいりょう', '賃借料'],
            ['8310', '58', '74', '0', 'ほけんりょう', '保険料'],
            ['8310', '59', '74', '0', 'しゅうぜんひ', '修繕費'],
            ['8310', '61', '74', '0', 'じむようひんひ', '事務用品費'],
            ['8310', '71', '74', '0', 'げんかしょうきゃくひ', '減価償却費'],
            ['8310', '72', '74', '0', 'かしだおれひきあてきんくりいいれ', '貸倒引当金繰入'],
            ['8310', '73', '74', '0', 'かしだおれそんしつ（かぜい）', '貸倒損失(課税)'],
            ['8310', '91', '74', '0', 'ざっぴ', '雑費'],
            ['8610', '11', '80', '1', 'うけとりりそく', '受取利息'],
            ['8610', '12', '80', '1', 'うけとりりそく（げんせん）', '受取利息(源泉)'],
            ['8620', '11', '80', '1', 'うけとりはいとうきん', '受取配当金'],
            ['8790', '11', '80', '1', 'ざつしゅうにゅう', '雑収入'],
            ['8810', '11', '80', '0', 'しはらいりそくわりびきりょう', '支払利息割引料'],
            ['8990', '11', '80', '0', 'ざつそんしつ', '雑損失'],
            ['8990', '21', '80', '0', 'かしだおれそんしつ（ひかぜい）', '貸倒損失(非課税)'],
            ['9110', '11', '90', '1', 'こていしさんばいきゃくえき', '固定資産売却益'],
            ['9210', '11', '90', '0', 'こていしさんばいきゃくそん', '固定資産売却損'],
            ['9810', '11', '91', '0', 'ほうじんぜいとう', '法人税等'],
            ['9910', '11', '31', '1', 'ぜんきくりこしりえき', '前期繰越利益'],
            ['9910', '12', '31', '0', 'ぜんきくりこしそんしつ', '前期繰越損失'],
            ['9920', '11', '90', '1', 'ちゅうかんはいとうとりくずしがく', '中間配当取崩額'],
            ['9970', '11', '90', '0', 'ちゅうかんはいとうがく', '中間配当額'],
        ];
    }

    private function _initTax() {

        $err = '';

        $this->connect();
        $this->begin();

        try {
            $sql = "SELECT `id` FROM `t_basic` ORDER BY `id`";
            $rec = $this->getRecord($sql);
            $fmt = "INSERT INTO `t_tax` (`bid`, `name`, `rate`, `valid_flg`) VALUES ('%s', '%s', '%s', TRUE)";
            $dat = [
                ['消費税8%',  '0.08']
            ,   ['消費税10%', '0.10']
            ];

            foreach ($rec as $r) {
                foreach ($dat as $d) {
                    $sql = sprintf($fmt, $r['id'], $d[0], $d[1]);
                    $ans = $this->query($sql);
                }
            }

        } catch(Exception $e) {
            $err = $e->getMessage();
        }

        if (empty($err)) {
            $this->commit();
        } else {
            $this->rollback();
        }

        $this->close();

        return $err;
    }

    private function _initEra() {

        $err = '';

        $this->connect();
        $this->begin();

        try {
            $sql = "SELECT `id` FROM `t_basic` ORDER BY `id`";
            $rec = $this->getRecord($sql);
            $fmt = "INSERT INTO `t_era` (`bid`, `ymd`, `era`, `abr`, `delete_flg`) VALUES ('%s', '%s', '%s', '%s', FALSE)";
            $dat = [
                ['1868-09-08', '明治', 'M'],
                ['1912-07-30', '大正', 'T'],
                ['1926-12-25', '昭和', 'S'],
                ['1989-01-08', '平成', 'H'],
                ['2019-05-01', '令和', 'R'],
            ];

            foreach ($rec as $r) {
                foreach ($dat as $d) {
                    $sql = sprintf($fmt, $r['id'], $d[0], $d[1], $d[2]);
                    $ans = $this->query($sql);
                }
            }

        } catch(Exception $e) {
            $err = $e->getMessage();
        }

        if (empty($err)) {
            $this->commit();
        } else {
            $this->rollback();
        }

        $this->close();

        return $err;
    }
}
